ART-Badge/SDK/libraries/inc/peripheral/rtl876x_codec.h
/**
*********************************************************************************************************
*               Copyright(c) 2019, Realtek Semiconductor Corporation. All rights reserved.
*********************************************************************************************************
* \file     rtl876x_codec.h
* \brief    The header file of the peripheral CODEC driver.
* \details  This file provides all CODEC firmware functions.
* \author   elliot chen
* \date     2019-10-25
* \version  v2.1.0
* *********************************************************************************************************
*/

#ifndef _RTL876X_CODEC_H_
#define _RTL876X_CODEC_H_

#ifdef __cplusplus
extern "C" {
#endif

/**
 * \addtogroup  IO          Peripheral Drivers
 * \defgroup    CODEC       CODEC
 *
 * \brief       Manage the CODEC peripheral functions.
 *
 * \ingroup     IO
 */

/*============================================================================*
 *                         Includes
 *============================================================================*/
#include "rtl876x.h"

/*============================================================================*
 *                         Types
 *============================================================================*/

/**
 * \defgroup    CODEC_Exported_Types    Init Params Struct
 *
 * \ingroup     CODEC
 */

/**
 * \brief       CODEC initialize parameters.
 *
 * \ingroup     CODEC_Exported_Types
 */
typedef struct
{
    /* Basic parameters section */
    uint32_t CODEC_SampleRate;          /*!< Specifies the sample rate. */
    uint32_t CODEC_DmicClock;           /*!< Specifies the dmic clock. */
    uint32_t CODEC_I2SFormat;           /*!< Specifies the I2S Tx/Rx format of codec port. */
    uint32_t CODEC_I2SDataWidth;        /*!< Specifies the I2S Tx/Rx data width of codec port. */
    uint32_t CODEC_I2SChSequence;       /*!< Specifies the I2S Tx/Rx channel sequence. */
    uint32_t CODEC_MicBIAS;             /*!< Specifies the MICBIAS voltage. */
    uint32_t CODEC_MicBstGain;          /*!< Specifies the MICBST gain. */
    uint32_t CODEC_MicBstMode;          /*!< Specifies the MICBST mode. */

    /* MIC channel 0 initialization parameters section */
    uint32_t CODEC_Ch0Mute;             /*!< Specifies the channel 0 dmic mute status. */
    uint32_t CODEC_Ch0MicType;          /*!< Specifies the channel 0 mic type, which can be dmic or amic. */
    uint32_t CODEC_Ch0DmicDataLatch;    /*!< Specifies the channel 0 dmic data latch type. */
    uint32_t CODEC_Ch0AdGain;           /*!< Specifies the channel 0 ADC digital volume. */
    uint32_t CODEC_Ch0BoostGain;        /*!< Specifies the channel 0 boost gain. */
    uint32_t CODEC_Ch0ZeroDetTimeout;   /*!< Specifies the channel 0 zero detection timeout mode control. */

    /* MIC channel 1 initialization parameters section */
    uint32_t CODEC_Ch1Mute;             /*!< Specifies the channel 1 dmic mute status. */
    uint32_t CODEC_Ch1MicType;          /*!< Specifies the channel 1 mic type, which can be dmic or amic. */
    uint32_t CODEC_Ch1DmicDataLatch;    /*!< Specifies the channel 1 dmic data latch type. */
    uint32_t CODEC_Ch1AdGain;           /*!< Specifies the channel 1 ADC digital volume. */
    uint32_t CODEC_Ch1BoostGain;        /*!< Specifies the channel 1 boost gain. */
    uint32_t CODEC_Ch1ZeroDetTimeout;   /*!< Specifies the channel 1 zero detection timeout mode control. */

    /* PDM initialization parameters section */
    uint32_t CODEC_PDMClockEdge;        /*!< Specifies the DAC clock edge. */
    uint32_t CODEC_PDMChannel;          /*!< Specifies the DAC channel type. */
    uint32_t CODEC_DaMute;              /*!< Specifies the DAC mute status. */
    uint32_t CODEC_DaGain;              /*!< Specifies the DAC gain control. */
    uint32_t CODEC_DacZeroDetTimeout;   /*!< Specifies the DAC zero detection timeout mode control. */
} CODEC_InitTypeDef;

/**
 * \brief       CODEC EQ part initialize parameters.
 *
 * \ingroup     CODEC_Exported_Types
 */
typedef struct
{
    uint32_t CODEC_EQChCmd;             /*!< Specifies the EQ channel status */
    uint32_t CODEC_EQCoefH0;            /*!< Specifies the EQ coef.h0. This value can be 0 to 0x7FFFF,
                                        whose physical meaning represents a range of-8 to 7.99 */
    uint32_t CODEC_EQCoefB1;            /*!< Specifies the EQ coef.b1. This value can be 0 to 0x7FFFF,
                                        whose physical meaning represents a range of-8 to 7.99 */
    uint32_t CODEC_EQCoefB2;            /*!< Specifies the EQ coef.b2. This value can be 0 to 0x7FFFF,
                                        whose physical meaning represents a range of-8 to 7.99 */
    uint32_t CODEC_EQCoefA1;            /*!< Specifies the EQ coef.a1. This value can be 0 to 0x7FFFF,
                                        whose physical meaning represents a range of-8 to 7.99 */
    uint32_t CODEC_EQCoefA2;            /*!< Specifies the EQ coef.a2. This value can be 0 to 0x7FFFF,
                                        whose physical meaning represents a range of-8 to 7.99 */
} CODEC_EQInitTypeDef;

/*============================================================================*
 *                         Register Defines
 *============================================================================*/

/* Peripheral: CODEC */
/* Description: CODEC register defines */

/* Register: ANA_CR0 ----------------------------------------------------------*/
/* Description: Control register 0. Offset: 0x00. Address: 0x40022000UL. */

/* ANA_CR0[10]: ADC_ANA_POW. 0x1: Powen on. 0x0: Power down. */
#define CODEC_ADC_ANA_POW_POS               (10)
#define CODEC_ADC_ANA_POW_MSK               (0x1 << CODEC_ADC_ANA_POW_POS)
#define CODEC_ADC_ANA_POW_CLR               (~CODEC_ADC_ANA_POW_MSK)
/* ANA_CR0[9]: DTSDM_CLK_EN. 0x1: Powen on. 0x0: Power down. */
#define CODEC_DTSDM_CLK_EN_POS              (9)
#define CODEC_DTSDM_CLK_EN_MSK              (0x1 << CODEC_DTSDM_CLK_EN_POS)
#define CODEC_DTSDM_CLK_EN_CLR              (~CODEC_DTSDM_CLK_EN_MSK)
/* ANA_CR0[0]: DAC_ADDACK_POW. 0x1: Powen on. 0x0: Power down. */
#define CODEC_DAC_ADDACK_POW_POS            (0)
#define CODEC_DAC_ADDACK_POW_MSK            (0x1 << CODEC_DAC_ADDACK_POW_POS)
#define CODEC_DAC_ADDACK_POW_CLR            (~CODEC_DAC_ADDACK_POW_MSK)

/* Register: ANA_CR1 ----------------------------------------------------------*/
/* Description: Control register 1. Offset: 0x04. Address: 0x40022004UL. */

/* ANA_CR1[27:26]: VREF_SEL. */
#define CODEC_VREF_SEL_POS                  (26)
#define CODEC_VREF_SEL_MSK                  (0x3 << CODEC_VREF_SEL_POS)
#define CODEC_VREF_SEL_CLR                  (~CODEC_VREF_SEL_MSK)
#define CODEC_VREF_SEL_DEFALUT_MSK          (0x2 << CODEC_VREF_SEL_POS)
/* ANA_CR1[25:24]: MICBST_POW. */
#define CODEC_MICBST_POW_POS                (24)
#define CODEC_MICBST_POW_MSK                (0x3 << CODEC_MICBST_POW_POS)
#define CODEC_MICBST_POW_CLR                (~CODEC_MICBST_POW_MSK)
/* ANA_CR1[21:20]: MICBST_MUTE. */
#define CODEC_MICBST_MUTE_POS               (20)
#define CODEC_MICBST_MUTE_MSK               (0x3 << CODEC_MICBST_MUTE_POS)
#define CODEC_MICBST_MUTE_CLR               (~CODEC_MICBST_MUTE_MSK)
#define CODEC_MICBST_MUTE_MIC_MSK           (0x2 << CODEC_MICBST_MUTE_POS)
/* ANA_CR1[17:16]: MICBST_GAIN. */
#define CODEC_MICBST_GAIN_POS               (16)
#define CODEC_MICBST_GAIN_MSK               (0x3 << CODEC_MICBST_GAIN_POS)
#define CODEC_MICBST_GAIN_CLR               (~CODEC_MICBST_GAIN_MSK)
/* ANA_CR1[15]: MICBST_VREF_POW. */
#define CODEC_MICBST_VREF_POW_POS           (15)
#define CODEC_MICBST_VREF_POW_MSK           (0x1 << CODEC_MICBST_VREF_POW_POS)
#define CODEC_MICBST_VREF_POW_CLR           (~CODEC_MICBST_VREF_POW_MSK)
/* ANA_CR1[14]: MICBST_ENDFL. */
#define CODEC_MICBST_ENDFL_POS              (14)
#define CODEC_MICBST_ENDFL_MSK              (0x1 << CODEC_MICBST_ENDFL_POS)
#define CODEC_MICBST_ENDFL_CLR              (~CODEC_MICBST_ENDFL_MSK)
/* ANA_CR1[13:11]: MICBIAS_VSET. */
#define CODEC_MICBIAS_VSET_POS              (11)
#define CODEC_MICBIAS_VSET_MSK              (0x7 << CODEC_MICBIAS_VSET_POS)
#define CODEC_MICBIAS_VSET_CLR              (~CODEC_MICBIAS_VSET_MSK)
/* ANA_CR1[10]: MICBIAS_POW. 0x1: Powen on. 0x0: Power down. */
#define CODEC_MICBIAS_POW_POS               (10)
#define CODEC_MICBIAS_POW_MSK               (0x1 << CODEC_MICBIAS_POW_POS)
#define CODEC_MICBIAS_POW_CLR               (~CODEC_MICBIAS_POW_MSK)
/* ANA_CR1[9]: MICBIAS_ENCHX. */
#define CODEC_MICBIAS_ENCHX_POS             (9)
#define CODEC_MICBIAS_ENCHX_MSK             (0x1 << CODEC_MICBIAS_ENCHX_POS)
#define CODEC_MICBIAS_ENCHX_CLR             (~CODEC_MICBIAS_ENCHX_MSK)

/* Register: ANA_CR2 ----------------------------------------------------------*/
/* Description: Control register 2. Offset: 0x08. Address: 0x40022008UL. */

/* ANA_CR2[14]: MICBIAS_POWSHDT. */
#define CODEC_MICBIAS_POWSHDT_POS           (14)
#define CODEC_MICBIAS_POWSHDT_MSK           (0x1 << CODEC_MICBIAS_POWSHDT_POS)
#define CODEC_MICBIAS_POWSHDT_CLR           (~CODEC_MICBIAS_POWSHDT_MSK)
#define CODEC_MICBIAS_POWSHDT_DEFALUT_MSK   (0)
/* ANA_CR2[13:12]: MICBIAS_OCSEL. */
#define CODEC_MICBIAS_OCSEL_POS             (12)
#define CODEC_MICBIAS_OCSEL_MSK             (0x3 << CODEC_MICBIAS_OCSEL_POS)
#define CODEC_MICBIAS_OCSEL_CLR             (~CODEC_MICBIAS_OCSEL_MSK)
#define CODEC_MICBIAS_OCSEL_DEFALUT_MSK     (0x1 << CODEC_MICBIAS_OCSEL_POS)
/* ANA_CR2[11:8]: MICBIAS_COUNT. */
#define CODEC_MICBIAS_COUNT_POS             (8)
#define CODEC_MICBIAS_COUNT_MSK             (0xF << CODEC_MICBIAS_COUNT_POS)
#define CODEC_MICBIAS_COUNT_CLR             (~CODEC_MICBIAS_COUNT_MSK)
#define CODEC_MICBIAS_COUNT_DEFALUT_MSK     (0x1 << CODEC_MICBIAS_COUNT_POS)

