ART-Badge/SDK/libraries/inc/peripheral/rtl876x_codec.h
/* Register: CR0 --------------------------------------------------------------*/
/* Description: audio Control register. Offset: 0x100. Address: 0x4002_2100UL. */

/* CR0[0]: AUDIO_IP_EN. */
#define CODEC_AUDIO_IP_EN_POS               (0)
#define CODEC_AUDIO_IP_EN_MSK               (0x1 << CODEC_AUDIO_IP_EN_POS)
#define CODEC_AUDIO_IP_EN_CLR               (~CODEC_AUDIO_IP_EN_MSK)

/* Register: ANA_CR1 -----------------------------------------------------------*/
/* Description: analog Control register. Offset: 0x104. Address: 0x4002_2104UL. */

/* ANA_CR1[3]: CKX_MICBIAS_EN. */
#define CODEC_CKX_MICBIAS_EN_POS           (3)
#define CODEC_CKX_MICBIAS_EN_MSK           (0x1 << CODEC_CKX_MICBIAS_EN_POS)
#define CODEC_CKX_MICBIAS_EN_CLR           (~CODEC_CKX_MICBIAS_EN_MSK)

/* Register: CLK_CR1 ----------------------------------------------------------*/
/* Description: clock Control register. Offset: 0x108. Address: 0x4002_2108UL. */

/* CLK_CR1[13]: AD_FILTER_CH1_CLK. 0x1: Enable clock. 0x0: Disable clock. */
#define CODEC_AD_FILTER_CH1_CLK_POS         (13)
#define CODEC_AD_FILTER_CH1_CLK_MSK         (0x1 << CODEC_AD_FILTER_CH1_CLK_POS)
#define CODEC_AD_FILTER_CH1_CLK_CLR         (~CODEC_AD_FILTER_CH1_CLK_MSK)
/* CLK_CR1[12]: AD_FILTER_CH0_CLK. 0x1: Enable clock. 0x0: Disable clock. */
#define CODEC_AD_FILTER_CH0_CLK_POS         (12)
#define CODEC_AD_FILTER_CH0_CLK_MSK         (0x1 << CODEC_AD_FILTER_CH0_CLK_POS)
#define CODEC_AD_FILTER_CH0_CLK_CLR         (~CODEC_AD_FILTER_CH0_CLK_MSK)
/* CLK_CR1[11]: AD_ANA_CLK_EN. 0x1: Enable ADC analog clock. 0x0: Disable ADC analog clock. */
#define CODEC_AD_ANA_CLK_EN_POS             (11)
#define CODEC_AD_ANA_CLK_EN_MSK             (0x1 << CODEC_AD_ANA_CLK_EN_POS)
#define CODEC_AD_ANA_CLK_EN_CLR             (~CODEC_AD_ANA_CLK_EN_MSK)
/* CLK_CR1[10]: AD_FIFO_CLK_EN. 0x1: Enable ADC FIFO clock. 0x0: Disable ADC FIFO clock. */
#define CODEC_AD_FIFO_CLK_EN_POS            (10)
#define CODEC_AD_FIFO_CLK_EN_MSK            (0x1 << CODEC_AD_FIFO_CLK_EN_POS)
#define CODEC_AD_FIFO_CLK_EN_CLR            (~CODEC_AD_FIFO_CLK_EN_MSK)
/* CLK_CR1[7]: AD_CH1_CLK. 0x1: Enable clock. 0x0: Disable clock. */
#define CODEC_AD_CH1_CLK_POS                (7)
#define CODEC_AD_CH1_CLK_MSK                (0x1 << CODEC_AD_CH1_CLK_POS)
#define CODEC_AD_CH1_CLK_CLR                (~CODEC_AD_CH1_CLK_MSK)
/* CLK_CR1[6]: AD_CH0_CLK. 0x1: Enable clock. 0x0: Disable clock. */
#define CODEC_AD_CH0_CLK_POS                (6)
#define CODEC_AD_CH0_CLK_MSK                (0x1 << CODEC_AD_CH0_CLK_POS)
#define CODEC_AD_CH0_CLK_CLR                (~CODEC_AD_CH0_CLK_MSK)
/* CLK_CR1[5]: DA_FIFO_CLK_EN. 0x1: Enable DAC FIFO clock. 0x0: Disable DAC FIFO clock. */
#define CODEC_DA_FIFO_CLK_EN_POS            (5)
#define CODEC_DA_FIFO_CLK_EN_MSK            (0x1 << CODEC_DA_FIFO_CLK_EN_POS)
#define CODEC_DA_FIFO_CLK_EN_CLR            (~CODEC_DA_FIFO_CLK_EN_MSK)
/* CLK_CR1[2]: PDM_CLK_EN. 0x1: Enable PDM clock. 0x0: Disable PDM clock. */
#define CODEC_PDM_CLK_EN_POS                (2)
#define CODEC_PDM_CLK_EN_MSK                (0x1 << CODEC_PDM_CLK_EN_POS)
#define CODEC_PDM_CLK_EN_CLR                (~CODEC_PDM_CLK_EN_MSK)
/* CLK_CR1[0]: DA_CLK_EN. 0x1: Enable DAC FIFO clock. 0x0: Disable DAC FIFO clock. */
#define CODEC_DA_CLK_EN_POS                 (0)
#define CODEC_DA_CLK_EN_MSK                 (0x1 << CODEC_DA_CLK_EN_POS)
#define CODEC_DA_CLK_EN_CLR                 (~CODEC_DA_CLK_EN_MSK)

/* Register: CLK_CR2 ----------------------------------------------------------*/
/* Description: clock Control register. Offset: 0x10C. Address: 0x4002_210CUL. */

/* CLK_CR2[3]: DMIC1_CLK_EN. 0x1: Enable clock. 0x0: Disable clock. */
#define CODEC_DMIC1_CLK_EN_POS              (3)
#define CODEC_DMIC1_CLK_EN_MSK              (0x1 << CODEC_DMIC1_CLK_EN_POS)
#define CODEC_DMIC1_CLK_EN_CLR              (~CODEC_DMIC1_CLK_EN_MSK)
/* CLK_CR2[2:0]: DMIC1_CLK_SEL. */
#define CODEC_DMIC1_CLK_SEL_POS             (0)
#define CODEC_DMIC1_CLK_SEL_MSK             (0x7 << CODEC_DMIC1_CLK_SEL_POS)
#define CODEC_DMIC1_CLK_SEL_CLR             (~CODEC_DMIC1_CLK_SEL_MSK)

/* Register: CLK_CR3 ----------------------------------------------------------*/
/* Description: clock Control register. Offset: 0x110. Address: 0x4002_2110UL. */

/* CLK_CR3[3:0]: SAMPLE_RATE. */
#define CODEC_SAMPLE_RATE_POS               (0)
#define CODEC_SAMPLE_RATE_MSK               (0xF << CODEC_SAMPLE_RATE_POS)
#define CODEC_SAMPLE_RATE_CLR               (~CODEC_SAMPLE_RATE_MSK)

/* Register: I2S_CTRL -------------------------------------------------------*/
/* Description: I2S Control register. Offset: 0x11C. Address: 0x4002_211CUL. */

/* I2S_CTRL[19:18]: I2S_RX_CH. */
#define CODEC_I2S_RX_CH_POS                 (18)
#define CODEC_I2S_RX_CH_MSK                 (0x3 << CODEC_I2S_RX_CH_POS)
#define CODEC_I2S_RX_CH_CLR                 (~CODEC_I2S_RX_CH_MSK)
/* I2S_CTRL[17:16]: I2S_TX_CH. */
#define CODEC_I2S_TX_CH_POS                 (16)
#define CODEC_I2S_TX_CH_MSK                 (0x3 << CODEC_I2S_TX_CH_POS)
#define CODEC_I2S_TX_CH_CLR                 (~CODEC_I2S_TX_CH_MSK)
/* I2S_CTRL[15:14]: I2S_RX_DATA_LEN. */
#define CODEC_I2S_RX_DATA_LEN_POS           (14)
#define CODEC_I2S_RX_DATA_LEN_MSK           (0x3 << CODEC_I2S_RX_DATA_LEN_POS)
#define CODEC_I2S_RX_DATA_LEN_CLR           (~CODEC_I2S_RX_DATA_LEN_MSK)
/* I2S_CTRL[13:12]: I2S_TX_DATA_LEN. */
#define CODEC_I2S_TX_DATA_LEN_POS           (12)
#define CODEC_I2S_TX_DATA_LEN_MSK           (0x3 << CODEC_I2S_TX_DATA_LEN_POS)
#define CODEC_I2S_TX_DATA_LEN_CLR           (~CODEC_I2S_TX_DATA_LEN_MSK)
/* I2S_CTRL[11:10]: I2S_RX_DATA_FORMAT. */
#define CODEC_I2S_RX_DATA_FORMAT_POS        (10)
#define CODEC_I2S_RX_DATA_FORMAT_MSK        (0x3 << CODEC_I2S_RX_DATA_FORMAT_POS)
#define CODEC_I2S_RX_DATA_FORMAT_CLR        (~CODEC_I2S_RX_DATA_FORMAT_MSK)
/* I2S_CTRL[9:8]: I2S_TX_DATA_FORMAT. */
#define CODEC_I2S_TX_DATA_FORMAT_POS        (8)
#define CODEC_I2S_TX_DATA_FORMAT_MSK        (0x3 << CODEC_I2S_TX_DATA_FORMAT_POS)
#define CODEC_I2S_TX_DATA_FORMAT_CLR        (~CODEC_I2S_TX_DATA_FORMAT_MSK)
/* I2S_CTRL[0]: AUDIO_RST_N. 0x1: Powen on. 0x0: Power down. */
#define CODEC_AUDIO_RST_N_POS               (0)
#define CODEC_AUDIO_RST_N_MSK               (0x1 << CODEC_AUDIO_RST_N_POS)
#define CODEC_AUDIO_RST_N_CLR               (~CODEC_AUDIO_RST_N_MSK)

/* Register: ADC0_CTRL0 -------------------------------------------------------*/
/* Description: ADC0 Control register. Offset: 0x120. Address: 0x4002_2120UL. */

/* ADC0_CTRL0[15]: AMIC_DMIC_CH0_SEL. 0x1: ADC path. 0x0: DMIC path. */
#define CODEC_AMIC_DMIC_CH0_SEL_POS         (15)
#define CODEC_AMIC_DMIC_CH0_SEL_MSK         (0x1 << CODEC_AMIC_DMIC_CH0_SEL_POS)
#define CODEC_AMIC_DMIC_CH0_SEL_CLR         (~CODEC_AMIC_DMIC_CH0_SEL_MSK)\
    /* ADC0_CTRL0[14:13]: ADC_CH0_BOOST_GAIN. */
#define CODEC_ADC_CH0_BOOST_GAIN_POS        (13)
#define CODEC_ADC_CH0_BOOST_GAIN_MSK        (0x3 << CODEC_ADC_CH0_BOOST_GAIN_POS)
#define CODEC_ADC_CH0_BOOST_GAIN_CLR        (~CODEC_ADC_CH0_BOOST_GAIN_MSK)
/* ADC0_CTRL0[12]: ADC_CH0_AD_MUTE. */
#define CODEC_ADC_CH0_AD_MUTE_POS           (12)
#define CODEC_ADC_CH0_AD_MUTE_MSK           (0x1 << CODEC_ADC_CH0_AD_MUTE_POS)
#define CODEC_ADC_CH0_AD_MUTE_CLR           (~CODEC_ADC_CH0_AD_MUTE_MSK)
/* ADC0_CTRL0[11:10]: ADC_CH0_ZDET_TOUT. */
#define CODEC_ADC_CH0_ZDET_TOUT_POS         (10)
#define CODEC_ADC_CH0_ZDET_TOUT_MSK         (0x3 << CODEC_ADC_CH0_ZDET_TOUT_POS)
#define CODEC_ADC_CH0_ZDET_TOUT_CLR         (~CODEC_ADC_CH0_ZDET_TOUT_MSK)
/* ADC0_CTRL0[9:8]: ADC_CH0_ZDET_FUN. 0x1: ADC path. 0x0: DMIC path. */
#define CODEC_ADC_CH0_ZDET_FUN_POS          (8)
#define CODEC_ADC_CH0_ZDET_FUN_MSK          (0x3 << CODEC_ADC_CH0_ZDET_FUN_POS)
#define CODEC_ADC_CH0_ZDET_FUN_CLR          (~CODEC_ADC_CH0_ZDET_FUN_MSK)
#define CODEC_ADC_CH0_ZDET_FUN_DEFAULT_MSK  (0x1 << CODEC_ADC_CH0_ZDET_FUN_POS)

/* ADC0_CTRL0[1:0]: DMIC_CH0_RI_FA_SEL. 0x1: Falling latching. 0x0: Rising latching. */
#define CODEC_DMIC_CH0_RI_FA_SEL_POS        (0)
#define CODEC_DMIC_CH0_RI_FA_SEL_MSK        (0x3 << CODEC_DMIC_CH0_RI_FA_SEL_POS)
#define CODEC_DMIC_CH0_RI_FA_SEL_CLR        (~CODEC_DMIC_CH0_RI_FA_SEL_MSK)
#define CODEC_ADC0_CTRL0_REG_DEFAULT_MSK    ((0x7 << 17) | (0x01 << 8) | (0x03 <<4))

/* Register: ADC1_CTRL0 -------------------------------------------------------*/
/* Description: ADC1 Control register. Offset: 0x128. Address: 0x4002_2128UL. */

