ART-Badge/SDK/libraries/inc/peripheral/rtl876x_codec.h
/* ADC1_CTRL0[15]: AMIC_DMIC_CH1_SEL. 0x1: ADC path. 0x0: DMIC path. */
#define CODEC_AMIC_DMIC_CH1_SEL_POS         (15)
#define CODEC_AMIC_DMIC_CH1_SEL_MSK         (0x1 << CODEC_AMIC_DMIC_CH1_SEL_POS)
#define CODEC_AMIC_DMIC_CH1_SEL_CLR         (~CODEC_AMIC_DMIC_CH1_SEL_MSK)
/* ADC1_CTRL0[14:13]: ADC_CH1_BOOST_GAIN. */
#define CODEC_ADC_CH1_BOOST_GAIN_POS        (13)
#define CODEC_ADC_CH1_BOOST_GAIN_MSK        (0x3 << CODEC_ADC_CH1_BOOST_GAIN_POS)
#define CODEC_ADC_CH1_BOOST_GAIN_CLR        (~CODEC_ADC_CH1_BOOST_GAIN_MSK)
/* ADC1_CTRL0[12]: ADC_CH1_AD_MUTE. */
#define CODEC_ADC_CH1_AD_MUTE_POS           (12)
#define CODEC_ADC_CH1_AD_MUTE_MSK           (0x1 << CODEC_ADC_CH1_AD_MUTE_POS)
#define CODEC_ADC_CH1_AD_MUTE_CLR           (~CODEC_ADC_CH1_AD_MUTE_MSK)
/* ADC1_CTRL0[11:10]: ADC_CH1_ZDET_TOUT. */
#define CODEC_ADC_CH1_ZDET_TOUT_POS         (10)
#define CODEC_ADC_CH1_ZDET_TOUT_MSK         (0x3 << CODEC_ADC_CH1_ZDET_TOUT_POS)
#define CODEC_ADC_CH1_ZDET_TOUT_CLR         (~CODEC_ADC_CH1_ZDET_TOUT_MSK)
/* ADC1_CTRL0[1:0]: DMIC_CH1_RI_FA_SEL. 0x1: Falling latching. 0x0: Rising latching. */
#define CODEC_DMIC_CH1_RI_FA_SEL_POS        (0)
#define CODEC_DMIC_CH1_RI_FA_SEL_MSK        (0x3 << CODEC_DMIC_CH1_RI_FA_SEL_POS)
#define CODEC_DMIC_CH1_RI_FA_SEL_CLR        (~CODEC_DMIC_CH1_RI_FA_SEL_MSK)
#define CODEC_ADC0_CTRL1_REG_DEFAULT_MSK    ((0x7 << 17) | (0x01 << 8) | (0x03 <<4))

/* Register: DAC_CTRL1 -------------------------------------------------------*/
/* Description: DAC Control register. Offset: 0x134. Address: 0x4002_2134UL. */

/* DAC_CTRL1[10]: PDM_CLOCK_SEL. */
#define CODEC_PDM_CLOCK_SEL_POS             (10)
#define CODEC_PDM_CLOCK_SEL_MSK             (0x1 << CODEC_PDM_CLOCK_SEL_POS)
#define CODEC_PDM_CLOCK_SEL_CLR             (~CODEC_PDM_CLOCK_SEL_MSK)
/* DAC_CTRL1[9:8]: PDM_CH_SEL. */
#define CODEC_PDM_CH_SEL_POS                (8)
#define CODEC_PDM_CH_SEL_MSK                (0x3 << CODEC_PDM_CH_SEL_POS)
#define CODEC_PDM_CH_SEL_CLR                (~CODEC_PDM_CH_SEL_MSK)
/* DAC_CTRL1[4]: DAC_MUTE. */
#define CODEC_DAC_MUTE_POS                  (4)
#define CODEC_DAC_MUTE_MSK                  (0x1 << CODEC_DAC_MUTE_POS)
#define CODEC_DAC_MUTE_CLR                  (~CODEC_DAC_MUTE_MSK)
/* DAC_CTRL1[3:2]: DAC_ZDET_TOUT. */
#define CODEC_DAC_ZDET_TOUT_POS             (2)
#define CODEC_DAC_ZDET_TOUT_MSK             (0x3 << CODEC_DAC_ZDET_TOUT_POS)
#define CODEC_DAC_ZDET_TOUT_CLR             (~CODEC_DAC_ZDET_TOUT_MSK)
/* DAC_CTRL1[1:0]: DAC_ZDET_FUN. */
#define CODEC_DAC_ZDET_FUN_POS              (0)
#define CODEC_DAC_ZDET_FUN_MSK              (0x3 << CODEC_DAC_ZDET_FUN_POS)
#define CODEC_DAC_ZDET_FUN_CLR              (~CODEC_DAC_ZDET_FUN_MSK)
#define CODEC_DAC_ZDET_DEFAULT_MSK          (0x1 << CODEC_DAC_ZDET_FUN_POS)

/*============================================================================*
 *                         Constants
 *============================================================================*/

/**
 * \defgroup    CODEC_Exported_Constants    Macro Definitions
 *
 * \ingroup     CODEC
 */

#define IS_CODEC_PERIPH(PERIPH) ((PERIPH) == CODEC)

/**
 * \defgroup    Sample_Rate_Definition  Sample Rate Definition
 * \{
 * \ingroup     CODEC_Exported_Constants
 */
#define SAMPLE_RATE_48KHz                           ((uint32_t)(0x00))
#define SAMPLE_RATE_96KHz                           ((uint32_t)(0x01 << CODEC_SAMPLE_RATE_POS))
#define SAMPLE_RATE_32KHz                           ((uint32_t)(0x03 << CODEC_SAMPLE_RATE_POS))
#define SAMPLE_RATE_16KHz                           ((uint32_t)(0x05 << CODEC_SAMPLE_RATE_POS))
#define SAMPLE_RATE_8KHz                            ((uint32_t)(0x07 << CODEC_SAMPLE_RATE_POS))
#define SAMPLE_RATE_44100Hz                         ((uint32_t)(0x08 << CODEC_SAMPLE_RATE_POS))
#define SAMPLE_RATE_88200Hz                         ((uint32_t)(0x09 << CODEC_SAMPLE_RATE_POS))
#define SAMPLE_RATE_24KHz                           ((uint32_t)(0x0A << CODEC_SAMPLE_RATE_POS))
#define SAMPLE_RATE_12KHz                           ((uint32_t)(0x0B << CODEC_SAMPLE_RATE_POS))
#define SAMPLE_RATE_22050Hz                         ((uint32_t)(0x0C << CODEC_SAMPLE_RATE_POS))
#define SAMPLE_RATE_11025Hz                         ((uint32_t)(0x0D << CODEC_SAMPLE_RATE_POS))
/** \} */

#define IS_SAMPLE_RATE(RATE) (((RATE) == SAMPLE_RATE_48KHz)   || ((RATE) == SAMPLE_RATE_96KHz)   || \
                              ((RATE) == SAMPLE_RATE_32KHz)   || ((RATE) == SAMPLE_RATE_16KHz)   || \
                              ((RATE) == SAMPLE_RATE_8KHz)    || ((RATE) == SAMPLE_RATE_44100Hz) || \
                              ((RATE) == SAMPLE_RATE_88200Hz) || ((RATE) == SAMPLE_RATE_24KHz)   || \
                              ((RATE) == SAMPLE_RATE_12KHz)   || ((RATE) == SAMPLE_RATE_22050Hz) || \
                              ((RATE) == SAMPLE_RATE_11025Hz))

/**
 * \defgroup    I2S_Data_Format I2S Data Format
 * \{
 * \ingroup     CODEC_Exported_Constants
 */
#define CODEC_I2S_DataFormat_I2S                    ((uint32_t)(0x00))
#define CODEC_I2S_DataFormat_LeftJustified          ((uint32_t)((0x01 << CODEC_I2S_RX_DATA_FORMAT_POS) | \
                                                                (0x01 << CODEC_I2S_TX_DATA_FORMAT_POS)))
#define CODEC_I2S_DataFormat_PCM_A                  ((uint32_t)((0x02 << CODEC_I2S_RX_DATA_FORMAT_POS) | \
                                                                (0x02 << CODEC_I2S_TX_DATA_FORMAT_POS)))
#define CODEC_I2S_DataFormat_PCM_B                  ((uint32_t)((0x03 << CODEC_I2S_RX_DATA_FORMAT_POS) | \
                                                                (0x03 << CODEC_I2S_TX_DATA_FORMAT_POS)))
/** \} */

#define IS_CODEC_I2S_DATA_FORMAT(FORMAT) (((FORMAT) == CODEC_I2S_DataFormat_I2S) || \
                                          ((FORMAT) == CODEC_I2S_DataFormat_LeftJustified) || \
                                          ((FORMAT) == CODEC_I2S_DataFormat_PCM_A) || \
                                          ((FORMAT) == CODEC_I2S_DataFormat_PCM_B))

/**
 * \defgroup    I2S_Data_Width I2S Data Width
 * \{
 * \ingroup     CODEC_Exported_Constants
 */
#define CODEC_I2S_DataWidth_16Bits                  ((uint32_t)(0x00))
#define CODEC_I2S_DataWidth_24Bits                  ((uint32_t)((0x02 << CODEC_I2S_RX_DATA_LEN_POS) | \
                                                                (0x02 << CODEC_I2S_TX_DATA_LEN_POS)))
#define CODEC_I2S_DataWidth_8Bits                   ((uint32_t)((0x03 << CODEC_I2S_RX_DATA_LEN_POS) | \
                                                                (0x03 << CODEC_I2S_TX_DATA_LEN_POS)))
/** \} */
#define IS_CODEC_I2S_DATA_WIDTH(WIDTH) (((WIDTH) == CODEC_I2S_DataWidth_16Bits) || \
                                        ((WIDTH) == CODEC_I2S_DataWidth_24Bits) || \
                                        ((WIDTH) == CODEC_I2S_DataWidth_8Bits))

/**
 * \defgroup    CODEC_I2S_CH CODEC I2S CH
 * \{
 * \ingroup     CODEC_Exported_Constants
 */
#define CODEC_I2S_CH_L_R                            ((uint32_t)(0x00))
#define CODEC_I2S_CH_R_L                            ((uint32_t)((0x01 << CODEC_I2S_TX_CH_POS) | \
                                                                (0x01 << CODEC_I2S_RX_CH_POS)))
#define CODEC_I2S_CH_L_L                            ((uint32_t)((0x02 << CODEC_I2S_TX_CH_POS) | \
                                                                (0x02 << CODEC_I2S_RX_CH_POS)))
#define CODEC_I2S_CH_R_R                            ((uint32_t)((0x03 << CODEC_I2S_TX_CH_POS) | \
                                                                (0x03 << CODEC_I2S_RX_CH_POS)))
/** \} */

#define IS_CODEC_I2S_CH(CH)             (((CH) == CODEC_I2S_CH_L_R) || \
                                         ((CH) == CODEC_I2S_CH_R_L) || \
                                         ((CH) == CODEC_I2S_CH_L_L) || \
                                         ((CH) == CODEC_I2S_CH_R_R))

/**
 * \defgroup    CODEC_MIC_BIAS_Config CODEC MIC BIAS Config
 * \{
 * \ingroup     CODEC_Exported_Constants
 */

