ART-Badge/SDK/libraries/inc/peripheral/rtl876x_codec.h
#define MICBIAS_VOLTAGE_1_507                       ((uint32_t)(0x00))
#define MICBIAS_VOLTAGE_1_62                        ((uint32_t)(0x01 << CODEC_MICBIAS_VSET_POS))
#define MICBIAS_VOLTAGE_1_705                       ((uint32_t)(0x02 << CODEC_MICBIAS_VSET_POS))
#define MICBIAS_VOLTAGE_1_8                         ((uint32_t)(0x03 << CODEC_MICBIAS_VSET_POS))
#define MICBIAS_VOLTAGE_1_906                       ((uint32_t)(0x04 << CODEC_MICBIAS_VSET_POS))
#define MICBIAS_VOLTAGE_2_025                       ((uint32_t)(0x05 << CODEC_MICBIAS_VSET_POS))
#define MICBIAS_VOLTAGE_2_16                        ((uint32_t)(0x06 << CODEC_MICBIAS_VSET_POS))
#define MICBIAS_VOLTAGE_2_314                       ((uint32_t)(0x07 << CODEC_MICBIAS_VSET_POS))
/** \} */

#define IS_MICBIAS_CONFIG(CONFIG) (((CONFIG) == MICBIAS_VOLTAGE_1_507) || ((CONFIG) == MICBIAS_VOLTAGE_1_62) || \
                                   ((CONFIG) == MICBIAS_VOLTAGE_1_705) || ((CONFIG) == MICBIAS_VOLTAGE_1_8) || \
                                   ((CONFIG) == MICBIAS_VOLTAGE_1_906) || ((CONFIG) == MICBIAS_VOLTAGE_2_025) || \
                                   ((CONFIG) == MICBIAS_VOLTAGE_2_16) || ((CONFIG) == MICBIAS_VOLTAGE_2_314))

/**
 * \defgroup    MICBST_Mode MICBST Mode
 * \{
 * \ingroup     CODEC_Exported_Constants
 */
#define MICBST_Mode_Single                          ((uint32_t)(0x0))
#define MICBST_Mode_Differential                    ((uint32_t)CODEC_MICBST_ENDFL_MSK)
/** \} */
#define IS_MICBST_MODE(MODE)            (((MODE) == MICBST_Mode_Single) || \
                                         ((MODE) == MICBST_Mode_Differential))

/**
 * \defgroup    MICBST_Gain MICBST Gain
 * \{
 * \ingroup     CODEC_Exported_Constants
 */
#define MICBST_Gain_0dB                             ((uint32_t)(0x0))
#define MICBST_Gain_20dB                            ((uint32_t)(0x1 << CODEC_MICBST_GAIN_POS))
#define MICBST_Gain_30dB                            ((uint32_t)(0x2 << CODEC_MICBST_GAIN_POS))
#define MICBST_Gain_40dB                            ((uint32_t)(0x3 << CODEC_MICBST_GAIN_POS))
/** \} */

#define IS_MICBST_GAIN(GAIN)            (((GAIN) == MICBST_Gain_0dB) || \
                                         ((GAIN) == MICBST_Gain_20dB) || \
                                         ((GAIN) == MICBST_Gain_30dB) || \
                                         ((GAIN) == MICBST_Gain_40dB))

/**
 * \defgroup    DMIC_Clock_Type_Definition DMIC Clock Type Definition
 * \{
 * \ingroup     CODEC_Exported_Constants
 */
#define DMIC_Clock_5MHz                             ((uint32_t)(0x0))
#define DMIC_Clock_2500KHz                          ((uint32_t)(0x01 << CODEC_DMIC1_CLK_SEL_POS))
#define DMIC_Clock_1250KHz                          ((uint32_t)(0x02 << CODEC_DMIC1_CLK_SEL_POS))
#define DMIC_Clock_625KHz                           ((uint32_t)(0x03 << CODEC_DMIC1_CLK_SEL_POS))
#define DMIC_Clock_312500Hz                         ((uint32_t)(0x04 << CODEC_DMIC1_CLK_SEL_POS))
/** \} */

#define IS_CODEC_DMIC_CLOCK(CLOCK) (((CLOCK) == DMIC_Clock_5MHz) || ((CLOCK) == DMIC_Clock_2500KHz) || \
                                    ((CLOCK) == DMIC_Clock_1250KHz) || ((CLOCK) == DMIC_Clock_625KHz) || \
                                    ((CLOCK) == DMIC_Clock_312500Hz))

/**
 * \defgroup    CODEC_Ch0_Mic_Type CODEC Ch0 Mic Type
 * \{
 * \ingroup     CODEC_Exported_Constants
 */

#define CODEC_CH0_MUTE                              (CODEC_ADC_CH0_AD_MUTE_MSK)
#define CODEC_CH0_UNMUTE                            (0)
/** \} */

#define IS_CODEC_CH0_MIC_MUTE(MUTE) (((MUTE) == CODEC_CH0_MUTE) || ((MUTE) == CODEC_CH0_UNMUTE))

/**
 * \defgroup    CODEC_Ch0_Mic_Type CODEC Ch0 Mic Type
 * \{
 * \ingroup     CODEC_Exported_Constants
 */
#define CODEC_CH0_AMIC                              (CODEC_AMIC_DMIC_CH0_SEL_MSK)
#define CODEC_CH0_DMIC                              (0)
/** \} */

#define IS_CODEC_CH0_MIC_TYPE(TYPE) (((TYPE) == CODEC_CH0_AMIC) || ((TYPE) == CODEC_CH0_DMIC))

/**
 * \defgroup    DMIC_Data_Latch_Edge DMIC Data Latch Edge
 * \{
 * \ingroup     CODEC_Exported_Constants
 */

#define DMIC_Ch0_Rising_Latch                        ((uint32_t)(0x00))
#define DMIC_Ch0_Falling_Latch                       ((uint32_t)(0x01 << CODEC_DMIC_CH0_RI_FA_SEL_POS))
/** \} */

#define IS_DMIC_CH0_LATCH_EDGE(EDGE) (((EDGE) == DMIC_Ch0_Rising_Latch) || ((EDGE) == DMIC_Ch0_Falling_Latch))

/**
 * \def         CODEC_AdGain Codec Ad Gain
 */

#define IS_AD_GAIN(GAIN)            (((GAIN)<= 0x7F))

/**
 * \defgroup    Ch0_Boost_Gain Ch0 Boost Gain
 * \{
 * \ingroup     CODEC_Exported_Constants
 */
#define Ch0_Boost_Gain_0dB                           ((uint32_t)(0x0))
#define Ch0_Boost_Gain_12dB                          ((uint32_t)(0x1 << CODEC_ADC_CH0_BOOST_GAIN_POS))
#define Ch0_Boost_Gain_24dB                          ((uint32_t)(0x2 << CODEC_ADC_CH0_BOOST_GAIN_POS))
#define Ch0_Boost_Gain_36dB                          ((uint32_t)(0x3 << CODEC_ADC_CH0_BOOST_GAIN_POS))
/** \} */

#define IS_CH0_BOOST_GAIN(GAIN)          (((GAIN) == Ch0_Boost_Gain_0dB) || \
                                          ((GAIN) == Ch0_Boost_Gain_12dB) || \
                                          ((GAIN) == Ch0_Boost_Gain_24dB) || \
                                          ((GAIN) == Ch0_Boost_Gain_36dB))

/**
 * \defgroup    Ch0_ADC_Zero_Detection_Timeout Ch0 ADC Zero Detection Timeout
 * \{
 * \ingroup     CODEC_Exported_Constants
 */

#define Ch0_ADC_Zero_DetTimeout_1024_16_Sample       ((uint32_t)(0x00))
#define Ch0_ADC_Zero_DetTimeout_1024_32_Sample       ((uint32_t)(0x01 << CODEC_ADC_CH0_ZDET_TOUT_POS))
#define Ch0_ADC_Zero_DetTimeout_1024_64_Sample       ((uint32_t)(0x02 << CODEC_ADC_CH0_ZDET_TOUT_POS))
#define Ch0_ADC_Zero_DetTimeout_64_Sample            ((uint32_t)(0x03 << CODEC_ADC_CH0_ZDET_TOUT_POS))
/** \} */

#define IS_CH0_ADC_ZERO_DET_TIMEOUT(TIMEOUT) (((TIMEOUT) == Ch0_ADC_Zero_DetTimeout_1024_16_Sample) || \
                                              ((TIMEOUT) == Ch0_ADC_Zero_DetTimeout_1024_32_Sample) || \
                                              ((TIMEOUT) == Ch0_ADC_Zero_DetTimeout_1024_64_Sample) || \
                                              ((TIMEOUT) == Ch0_ADC_Zero_DetTimeout_64_Sample))

/**
 * \defgroup    CODEC_Ch1_Mic_Type CODEC Ch1 Mic Type
 * \{
 * \ingroup     CODEC_Exported_Constants
 */
#define CODEC_CH1_MUTE                               (CODEC_ADC_CH1_AD_MUTE_MSK)
#define CODEC_CH1_UNMUTE                             (0)
/** \} */

#define IS_CODEC_CH1_MIC_MUTE(MUTE) (((MUTE) == CODEC_CH1_MUTE) || ((MUTE) == CODEC_CH1_UNMUTE))

/**
 * \defgroup    CODEC_Ch1_Mic_Type CODEC Ch1 Mic Type
 * \{
 * \ingroup     CODEC_Exported_Constants
 */
#define CODEC_CH1_AMIC                               (CODEC_AMIC_DMIC_CH1_SEL_MSK)
#define CODEC_CH1_DMIC                               (0)
/** \} */

