ART-Badge/SDK/libraries/inc/peripheral/rtl876x_codec.h
#define IS_CODEC_CH1_MIC_TYPE(TYPE) (((TYPE) == CODEC_CH1_AMIC) || ((TYPE) == CODEC_CH1_DMIC))

/**
 * \defgroup    DMIC_Data_Latch_Edge DMIC Data Latch Edge
 * \{
 * \ingroup     CODEC_Exported_Constants
 */
#define DMIC_Ch1_Rising_Latch                        ((uint32_t)(0x00))
#define DMIC_Ch1_Falling_Latch                       ((uint32_t)(0x01 << CODEC_DMIC_CH1_RI_FA_SEL_POS))
/** \} */

#define IS_DMIC_CH1_LATCH_EDGE(EDGE) (((EDGE) == DMIC_Ch1_Rising_Latch) || ((EDGE) == DMIC_Ch1_Falling_Latch))

/**
 * \defgroup    Ch1_Boost_Gain Ch1 Boost Gain
 * \{
 * \ingroup     CODEC_Exported_Constants
 */
#define Ch1_Boost_Gain_0dB                           ((uint32_t)(0x0))
#define Ch1_Boost_Gain_12dB                          ((uint32_t)(0x1 << CODEC_ADC_CH1_BOOST_GAIN_POS))
#define Ch1_Boost_Gain_24dB                          ((uint32_t)(0x2 << CODEC_ADC_CH1_BOOST_GAIN_POS))
#define Ch1_Boost_Gain_36dB                          ((uint32_t)(0x3 << CODEC_ADC_CH1_BOOST_GAIN_POS))
/** \} */

#define IS_CH1_BOOST_GAIN(GAIN)          (((GAIN) == Ch1_Boost_Gain_0dB) || \
                                          ((GAIN) == Ch1_Boost_Gain_12dB) || \
                                          ((GAIN) == Ch1_Boost_Gain_24dB) || \
                                          ((GAIN) == Ch1_Boost_Gain_36dB))

/**
 * \defgroup    Ch1_ADC_Zero_Detection_Timeout Ch1 ADC Zero Detection Timeout
 * \{
 * \ingroup     CODEC_Exported_Constants
 */
#define Ch1_ADC_Zero_DetTimeout_1024_16_Sample      ((uint32_t)(0x00))
#define Ch1_ADC_Zero_DetTimeout_1024_32_Sample      ((uint32_t)(0x01 << CODEC_ADC_CH1_ZDET_TOUT_POS))
#define Ch1_ADC_Zero_DetTimeout_1024_64_Sample      ((uint32_t)(0x02 << CODEC_ADC_CH1_ZDET_TOUT_POS))
#define Ch1_ADC_Zero_DetTimeout_64_Sample           ((uint32_t)(0x03 << CODEC_ADC_CH1_ZDET_TOUT_POS))
/** \} */

#define IS_CH1_ADC_ZERO_DET_TIMEOUT(TIMEOUT) (((TIMEOUT) == Ch1_ADC_Zero_DetTimeout_1024_16_Sample) || \
                                              ((TIMEOUT) == Ch1_ADC_Zero_DetTimeout_1024_32_Sample) || \
                                              ((TIMEOUT) == Ch1_ADC_Zero_DetTimeout_1024_64_Sample) || \
                                              ((TIMEOUT) == Ch1_ADC_Zero_DetTimeout_64_Sample))

/**
 * \defgroup    PDM_Clock_Edge PDM Clock Edge
 * \{
 * \ingroup     CODEC_Exported_Constants
 */
#define PDM_Clock_Rising_Edge                       ((uint32_t)(0x00))
#define PDM_Clock_Falling_Edge                      ((uint32_t)CODEC_PDM_CLOCK_SEL_MSK)
/** \} */

#define IS_PDM_Clock_EDGE(EDGE) (((EDGE) == PDM_Clock_Rising_Edge) || ((EDGE) == PDM_Clock_Falling_Edge))

/**
 * \defgroup    PDM_Channel PDM channel
 * \{
 * \ingroup     CODEC_Exported_Constants
 */
#define PDM_CH_L_L                                  (0)
#define PDM_CH_L_R                                  ((uint32_t)0x01 << CODEC_PDM_CH_SEL_POS)
#define PDM_CH_R_L                                  ((uint32_t)0x02 << CODEC_PDM_CH_SEL_POS)
#define PDM_CH_R_R                                  ((uint32_t)0x03 << CODEC_PDM_CH_SEL_POS)
/** \} */

#define IS_PDM_CH(CH)               (((CH) == PDM_CH_L_L) || ((CH) == PDM_CH_L_R) || \
                                     ((CH) == PDM_CH_R_L) || ((CH) == PDM_CH_R_R))

/**
 * \defgroup    DAC_Mute_Control DAC Mute Control
 * \{
 * \ingroup     CODEC_Exported_Constants
 */
#define DAC_UuMute                                  ((uint32_t)(0x0))
#define DAC_Mute                                    (CODEC_DAC_MUTE_MSK)
/** \} */

#define IS_DAC_MUTE(MUTE)               (((MUTE) == DAC_UuMute) || ((MUTE) == DAC_Mute))

/**
 * \def     CODEC_Da_Gain Codec Da Gain
 *
 */
#define IS_DA_GAIN(GAIN)            (((GAIN)<= 0xFF))

/**
 * \defgroup    DAC_Zero_Detection_Timeout DAC Zero Detection Timeout
 * \{
 * \ingroup     CODEC_Exported_Constants
 */
#define DAC_Zero_DetTimeout_1024_16_Sample          ((uint32_t)(0x00 << CODEC_DAC_ZDET_TOUT_POS))
#define DAC_Zero_DetTimeout_1024_32_Sample          ((uint32_t)(0x01 << CODEC_DAC_ZDET_TOUT_POS))
#define DAC_Zero_DetTimeout_1024_64_Sample          ((uint32_t)(0x02 << CODEC_DAC_ZDET_TOUT_POS))
#define DAC_Zero_DetTimeout_256_Sample              ((uint32_t)(0x03 << CODEC_DAC_ZDET_TOUT_POS))
/** \} */

#define IS_DAC_ZERO_DET_TIMEOUT(TIMEOUT) (((TIMEOUT) == DAC_Zero_DetTimeout_1024_16_Sample) || \
                                          ((TIMEOUT) == DAC_Zero_DetTimeout_1024_32_Sample) || \
                                          ((TIMEOUT) == DAC_Zero_DetTimeout_1024_64_Sample) || \
                                          ((TIMEOUT) == DAC_Zero_DetTimeout_256_Sample))

/**
 * \defgroup    EQ_CH_Cmd EQ Channel Cmd
 * \{
 * \ingroup     CODEC_Exported_Constants
 */
#define EQ_CH_ENABLE                            ((uint32_t)(0x01))
#define EQ_CH_DISABLE                           ((uint32_t)(0x00))
/** \} */
#define IS_EQ_CH_STATUS(STATUS) (((STATUS) == EQ_CH_ENABLE) || \
                                 ((STATUS) == EQ_CH_DISABLE))


/*============================================================================*
 *                         Functions
 *============================================================================*/

/**
 * \defgroup    CODEC_Exported_Functions Peripheral APIs
 * \{
 * \ingroup     CODEC
 */

/**
 * \brief   Deinitializes the CODEC peripheral registers to their default reset values(turn off CODEC clock).
 * \param[in] CODECx: CODEC peripheral selected .
 * \return None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void driver_codec_init(void)
 * {
 *     CODEC_DeInit(CODEC);
 * }
 * \endcode
 */
void CODEC_DeInit(CODEC_TypeDef *CODECx);

/**
 * \brief   Initializes the CODEC peripheral according to the specified
 *          parameters in the CODEC_InitStruct.
 * \param[in] CODECx: CODEC peripheral selected.
 * \param[in] CODEC_InitStruct: Pointer to a CODEC_InitTypeDef structure that
 *            contains the configuration information for the specified CODEC peripheral
 * \return None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void driver_codec_init(void)
 * {
 *     RCC_PeriphClockCmd(APBPeriph_CODEC, APBPeriph_CODEC_CLOCK, ENABLE);
 *
 *     CODEC_InitTypeDef CODEC_InitStruct;

